"""
进制:
二进制 :0,1
八进制 :0,1,2,3,4,5,6,7
十进制 :0,1,2,3,4,5,6,7,8,9
十六进制 :0,1,2,3,4,5,6,7,8,9,A,B,C,D,E,F
8,4,2,1 来快速计算二进制转换为10进制





--bin(转二进制)    且0b为二进制
--oct(转八进制)    且0o为八进制
--hex(转十六进制)  且0x为十六进制
--int(转十进制)    且开头为空是默认
"""

# 149 -> '1010101'
numb = 221
print(hex(numb))
# 输出结果为 0b10010101 带有0b则为2进制

# 转八进制
# 100/8 = 12...4
# 12/8  = 1....4
# 1/8   = 0....1

# 1 4 4

"""
1 = 8的2次方
4 = 8的1次方
4 = 8的0次方
64+32+4 = 100
"""

# 思考题
n = 0x558
print(int(n))  # 向二进制转换
print(oct(n))  # 向八进制转换
'''
八进制是由二进制的3位一分计算的,不够的补0
十六进制是由二进制4位一分计算的,不够的补0



'''